results-petclinic-harness_2_0_0-jvm-shenandoah-run/result-2026-01-05-22:49:38/wrk2_results_20260105_224947.txt
Running 30s test @ http://petclinic:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 1797.852ms, rate sampling interval: 4595ms
  Thread calibration: mean lat.: 1802.875ms, rate sampling interval: 4579ms
  Thread calibration: mean lat.: 1899.550ms, rate sampling interval: 4874ms
  Thread calibration: mean lat.: 1767.676ms, rate sampling interval: 4526ms
  Thread calibration: mean lat.: 1870.966ms, rate sampling interval: 4808ms
  Thread calibration: mean lat.: 1839.594ms, rate sampling interval: 4739ms
  Thread calibration: mean lat.: 1957.396ms, rate sampling interval: 5013ms
  Thread calibration: mean lat.: 1785.110ms, rate sampling interval: 4648ms
  Thread calibration: mean lat.: 1661.935ms, rate sampling interval: 4186ms
  Thread calibration: mean lat.: 1551.089ms, rate sampling interval: 3905ms
  Thread calibration: mean lat.: 1888.283ms, rate sampling interval: 4968ms
  Thread calibration: mean lat.: 1618.793ms, rate sampling interval: 4300ms
  Thread calibration: mean lat.: 1599.449ms, rate sampling interval: 4175ms
  Thread calibration: mean lat.: 1800.938ms, rate sampling interval: 4579ms
  Thread calibration: mean lat.: 1534.105ms, rate sampling interval: 3971ms
  Thread calibration: mean lat.: 1544.487ms, rate sampling interval: 4069ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   265.12ms  512.75ms   2.16s    82.86%
    Req/Sec   205.65     32.01   270.00     74.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.04ms
 75.000%  142.21ms
 90.000%    1.22s 
 99.000%    1.81s 
 99.900%    2.06s 
 99.990%    2.15s 
 99.999%    2.16s 
100.000%    2.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.560     0.000000            1         1.00
       1.089     0.100000         6511         1.11
       1.327     0.200000        13007         1.25
       1.535     0.300000        19487         1.43
       1.732     0.400000        25991         1.67
       2.037     0.500000        32485         2.00
       2.289     0.550000        35734         2.22
       2.637     0.600000        38969         2.50
       3.299     0.650000        42219         2.86
       4.967     0.700000        45466         3.33
     142.207     0.750000        48710         4.00
     365.567     0.775000        50337         4.44
     564.735     0.800000        51957         5.00
     752.127     0.825000        53581         5.71
     918.015     0.850000        55207         6.67
    1075.199     0.875000        56843         8.00
    1137.663     0.887500        57640         8.89
    1224.703     0.900000        58457        10.00
    1303.551     0.912500        59270        11.43
    1376.255     0.925000        60084        13.33
    1441.791     0.937500        60893        16.00
    1489.919     0.943750        61301        17.78
    1528.831     0.950000        61703        20.00
    1562.623     0.956250        62116        22.86
    1587.199     0.962500        62513        26.67
    1620.991     0.968750        62923        32.00
    1637.375     0.971875        63127        35.56
    1655.807     0.975000        63328        40.00
    1681.407     0.978125        63528        45.71
    1712.127     0.981250        63729        53.33
    1740.799     0.984375        63935        64.00
    1755.135     0.985938        64034        71.11
    1770.495     0.987500        64140        80.00
    1797.119     0.989062        64238        91.43
    1820.671     0.990625        64342       106.67
    1842.175     0.992188        64441       128.00
    1856.511     0.992969        64494       142.22
    1872.895     0.993750        64542       160.00
    1901.567     0.994531        64593       182.86
    1917.951     0.995313        64642       213.33
    1941.503     0.996094        64696       256.00
    1947.647     0.996484        64718       284.44
    1954.815     0.996875        64744       320.00
    1967.103     0.997266        64770       365.71
    1981.439     0.997656        64794       426.67
    2019.327     0.998047        64820       512.00
    2023.423     0.998242        64832       568.89
    2029.567     0.998437        64845       640.00
    2037.759     0.998633        64859       731.43
    2049.023     0.998828        64872       853.33
    2062.335     0.999023        64883      1024.00
    2074.623     0.999121        64891      1137.78
    2083.839     0.999219        64896      1280.00
    2089.983     0.999316        64902      1462.86
    2101.247     0.999414        64908      1706.67
    2117.631     0.999512        64915      2048.00
    2119.679     0.999561        64918      2275.56
    2123.775     0.999609        64922      2560.00
    2125.823     0.999658        64925      2925.71
    2127.871     0.999707        64929      3413.33
    2131.967     0.999756        64931      4096.00
    2136.063     0.999780        64932      4551.11
    2140.159     0.999805        64934      5120.00
    2144.255     0.999829        64935      5851.43
    2150.399     0.999854        64937      6826.67
    2154.495     0.999878        64942      8192.00
    2154.495     0.999890        64942      9102.22
    2154.495     0.999902        64942     10240.00
    2154.495     0.999915        64942     11702.86
    2154.495     0.999927        64942     13653.33
    2156.543     0.999939        64943     16384.00
    2156.543     0.999945        64943     18204.44
    2156.543     0.999951        64943     20480.00
    2158.591     0.999957        64944     23405.71
    2158.591     0.999963        64944     27306.67
    2162.687     0.999969        64945     32768.00
    2162.687     0.999973        64945     36408.89
    2162.687     0.999976        64945     40960.00
    2162.687     0.999979        64945     46811.43
    2162.687     0.999982        64945     54613.33
    2164.735     0.999985        64946     65536.00
    2164.735     1.000000        64946          inf
#[Mean    =      265.122, StdDeviation   =      512.748]
#[Max     =     2162.688, Total count    =        64946]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89696 requests in 29.71s, 12.07MB read
Requests/sec:   3019.23
Transfer/sec:    415.93KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 89696
Total errors (4xx/5xx): 0
Threads aggregated: 16

Status code distribution:
  302:    89696 (100.00%) ██████████████████████████████████████████████████

Histogram data written to: /wrktemp/results/response_histogram.json